package com.example.custombottomnavigation.fragments;

import android.os.Bundle;

import androidx.annotation.NonNull;
import androidx.annotation.Nullable;
import androidx.fragment.app.Fragment;
import androidx.fragment.app.FragmentTransaction;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.Adapter;
import android.widget.ImageView;
import android.widget.LinearLayout;

import com.example.custombottomnavigation.HomeFragment;
import com.example.custombottomnavigation.MainActivity;
import com.example.custombottomnavigation.R;
import com.example.custombottomnavigation.adapter.DuaListAdapter;
import com.example.custombottomnavigation.models.DuaItems;

import java.util.ArrayList;
import java.util.List;


public class DuaListFragment extends Fragment {

    RecyclerView recyclerView;
    LinearLayoutManager layoutManager;
    List<DuaItems> duaItems;
    DuaListAdapter adapter;
    ImageView backBtn;




    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {


        //HIDE TOOLBAR
        MainActivity.toolbar.setVisibility(View.GONE);

//       show all List dua Data
        initData();
        // Inflate the layout for this fragment
        return inflater.inflate(R.layout.fragment_dua_list, container, false);
    }

    private void initData() {
        duaItems=new ArrayList<>();
        duaItems.add(new DuaItems("ঘুমানোর সময় পড়ার দোয়া"," اَللَّهُمَّ بِاسْمِكَ أَمُوتُ وَأَحْيَا","আল্লাহুম্মা বিসমিকা আমুতু ওয়া আহইয়া","অর্থ : ‘হে আল্লাহ! আপনারই নামে মরে যাই আবার আপনারই নামে জীবন লাভ করি।’","1"));
        duaItems.add(new DuaItems("ঘুম থেকে উঠে পড়ার দোয়া"," الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ","আলহামদু লিল্লাহিল লাজি আহইয়ানা বা’দা মা আমাতানা ওয়া ইলাইহিন নুশুর","অর্থ : ‘সব প্রশংসা ওই আল্লাহর জন্য, যিনি মৃত্যুর পর আমাদের জীবন দান করেছেন এবং তার দিকেই আমাদের পুনরুত্থান।’","1"));
        duaItems.add(new DuaItems("ওযুর দোয়া","اَللَّخُمَّ اغْفِرْلِىْ ذَنْبِى وَ وَسِّعْلِىْ فِىْ دَارِىْ وَبَارِكْ لِىْ فِىْ رِزْقِىْ","আল্লাহুম্মাগফিরলি জামবি, ওয়া ওয়াসসিলি ফি দারি, ওয়া বারিক লি ফি রিযক্বি। (নাসাঈ)","অর্থ : ‘হে আল্লাহ! আমার গোনাহ মাফ করে দাও। আমার জন্য আমার বাসস্থান প্রশস্ত করে দাও। এবং আমার রিযিক্বে বরকত দিয়ে দাও।’","1"));
        duaItems.add(new DuaItems("মসজিদে প্রবেশ করার সময়ের দোয়া","اَللّٰهُمَّ افْتَحْ لِيْ اَبْوَابَ رَحْمَتِكَ","আল্লাহুম্মাফতাহলী আবওয়াবা রাহমাতিক","অর্থঃ হে আল্লাহ! তোমার রহমতের দরজা আমার জন্য খুলে দাও।","1"));
        duaItems.add(new DuaItems("মসজিদ হতে বের হওয়ার দোয়া", "اَللّٰهمَّ اِنِّي اَسْٮَٔلُكَ مِنْ فَضْلِكِ","আল্লাহুম্মা ইন্নী আসআলূকা মিস ফাযলিকা","অর্থঃ হে আল্লাহ আমি আপনার দয়া প্রার্থনা করি।","1"));
        //
        duaItems.add(new DuaItems("খাবার গ্রহণের দোয়া", "اَللَّهُمَّ بَارِكْ لَنَا فِيْهِ وَ اَطْعِمْنَا خَيْراً مِّنْهُ","আল্লাহুম্মা বা-রিক্ লানা- ফী-হি ওয়া আত্বইমনা খাইরাম্ মিনহু","অর্থ : ‘হে আল্লাহ! আমাদেরকে এতে বরকত দিন, ভবিষ্যতে আরো উত্তম খাদ্য দিন’। (তিরমিজি, আবু দাউদ, মিশকাত)","1"));
        duaItems.add(new DuaItems("খাবার শেষের দোয়া", " اَلْحَمْدُ لِلّهِ الَّذِيْ اَطْعَمَنَا وَ سَقَانَا وَ جَعَلَنَا مِنَ الْمُسْلِمِيْن","আলহামদুলিল্লাহি আতআমানা, ওয়াসাকানা, ওয়াকাফানা, ওয়াআয়ানা, ওয়া আরওয়ানা, ওয়াজা আলানা মিনাল মুসলিমীন।","অর্থ : সব প্রশংসা আল্লাহর জন্য, যিনি আমাদের খাইয়েছেন, পান করিয়েছেন এবং মুসলিম বানিয়েছেন।","1"));
        duaItems.add(new DuaItems("বাসা হতে বের হওয়ার সময়ের দোয়া", " بِسْمِ اللهِ تَوَكَّلْتُ عَلَى اللهِ وَ لَا حَوْلَ وَ لَا قُوَّةَ اِلَّا بِاللَّهِ","বিসমিল্লাহি, তাওয়াক্কালতু আলাল্লাহি, ওয়া লা হাওলা ওয়া লা কুওয়্যাতা ইল্লা বিল্লাহি।","অর্থ : আল্লাহর নামে, আল্লাহর ওপর ভরসা করে বের হচ্ছি, আল্লাহ ছাড়া কোনো ভালো কাজ করার কিংবা মন্দ কাজ থেকে বিরত থাকা সম্ভব নয়।","1"));
        duaItems.add(new DuaItems("ঘরে প্রবেশ করার দোয়া", " ِبِسْمِ اللَّهِ وَلَجْنَا، وَبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى اللَّهِ رَبِّنَا تَوَكَّلْنَا","বিসমিল্লাহি ওয়ালাঝনা; ওয়া বিসমিল্লাহি খারাঝনা; ওয়া আলাল্লাহি রাব্বিনা তাওয়াক্কালনা।","অর্থ : ‘আল্লাহ্র নামে আমরা (ঘরে) প্রবেশ করলাম, আল্লাহর নামেই আমরা (ঘর থেকে) বের হলাম এবং আমাদের রব আল্লাহ্র উপরই আমরা ভরসা করলাম।’ অতপর ঘরের লোকদের সালাম দিয়ে প্রবেশ করা।’ (আবু দাউদ)","1"));
        duaItems.add(new DuaItems("কাপড় পরিধানের দো‘আ", "اَلْحَمْدُ للهِ الَّذِى كَسَانِىْ مَا اُوَارىُ بِهِ عَوْرَاتِىْ وَ اَتَجَمَّلُ بِهِ فِىْ حَيَاتِىْ","আলহামদুলিল্লাহিল্লাজি কাসানি মা উয়ারিউবিহি আওরাতি ওয়া আতাঝাম্মালুবিহি ফি হায়াতি।","অর্থ: সব প্রশংসা আল্লাহর যিনি আমাকে কাপড় পরিয়েছেন, যা দিয়ে আমি লজ্জাস্থান ঢাকি এবং জীবনে সৌন্দর্য লাভ করি।","1"));
        duaItems.add(new DuaItems("অপরকে নতুন কাপড় পরিধান করতে দেখলে তার জন্য দো‘আ ", "تُبْلِي وَيُخْلِفُ اللّٰهُ تَعَالٰى ","তুবলী ওয়া ইয়ুখলিফুল্লা-হু তা‘আলা","অর্থ: “তুমি পুরাতন করে ফেলবে, আর মহান আল্লাহ এর স্থলাভিষিক্ত করবেন”","1"));
        duaItems.add(new DuaItems("শৌচালয়ে প্রবেশের দো‘আ ", "بِبِسْمِ اللهِ اَللهُمَّ إِنّيْ أَعًوْذُ بِكَ مِنَ الْخُبْثِ وَ الْخَبَائِثِ ","বিসমিল্লাহি আল্লাহুম্মা ইন্নি আউজুবিকা মিনাল খুবুছি ওয়াল খাবায়িছ","অর্থ: “অর্থ : ‘আল্লাহর নামে (শুরু করছি); হে আল্লাহ! নিশ্চয়ই আমি আপনার কাছে পুরুষ ও স্ত্রী শয়তানের অনিষ্ট তথা ক্ষতি থেকে আশ্রয় চাই।’ (বুখারি, মুসলিম, ইবনে মাজাহ)”","1"));
        duaItems.add(new DuaItems("শৌচালয় থেকে বের হওয়ার দো‘আ ", "ﻏُﻔْﺮَﺍﻧَﻚَ اَللَّهُمَّ ","গোফরানাকা আল্লাহুম্মা","অর্থ : হে আল্লাহ! আপনার কাছে ক্ষমা চাই।’ (আবু দাউদ)","1"));
        duaItems.add(new DuaItems("ঋণ মুক্তির জন্য দো‘আ  ", "اللَّهُمَّ اكْفِنِي بِحَلاَلِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكِ عَمَّنْ سِوَاكَ","আল্লা-হুম্মাকফিনী বিহালা-লিকা ‘আন হারা-মিকা ওয়া আগনিনী বিফাদ্বলিকা ‘আম্মান সিওয়া-ক","অর্থাৎ “হে আল্লাহ! নিশ্চয় আমি আপনার আশ্রয় নিচ্ছি দুশ্চিন্তা ও দুঃখ থেকে, অপারগতা ও অলসতা থেকে, কৃপণতা ও ভীরুতা থেকে, ঋণের ভার ও মানুষদের দমন-পীড়ন থেকে।” (বুখারি, মুসলিম ও মিশকাত)","1"));
        duaItems.add(new DuaItems("মেঘের গর্জন শুনলে পড়ার দো‘আ ", "سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلاَئِكةُ مِنْ خِيفَتِهِ","সুবহা-নাল্লাযী ইউসাব্বিহুর –রা‘দু বিহামদিহি ওয়াল-মালা-ইকাতু মিন খীফাতিহি"," “পবিত্র-মহান সেই সত্তা, রা‘দ ফেরেশ্তা যাঁর মহিমা ও পবিত্রতা ঘোষণা করে প্রশংসার সাথে, আর ফেরেশ্তাগণও তা-ই করে যাঁর ভয়ে।”","1"));
        duaItems.add(new DuaItems("বৃষ্টি চাওয়ার কিছু দো‘আ  ", "اللَّهُمَّ اسْقِنَا غَيْثاً مُغِيثاً مَرِيئاً مَرِيعاً، نَافِعاً غَيْرَ ضَارٍّ، عَاجِلاً غَيْرَ آجِلٍ","আল্লা-হুম্মা আসক্বিনা গাইসান মুগীসান মারী’য়ান মারী‘আন না-ফি‘আন গাইরা দ্বাররিন ‘আ-জিলান গাইরা আ-জিলিন"," “হে আল্লাহ! আমাদেরকে এমন বৃষ্টির পানি দান করুন যা সাহায্যকারী, সুপেয়, উর্বরকারী; কল্যাণকর, ক্ষতিকর নয়; শীঘ্রই, বিলম্বে নয়।”","1"));
        duaItems.add(new DuaItems("বৃষ্টি বর্ষণের পর যিকর ", "مُطِرْنَا بِفَضْلِ اللّٰهِ وَرَحْمَتِهِ","মুতিরনা বিফাদলিল্লা-হি ওয়া রহমাতি-হি"," “আল্লাহ্র অনুগ্রহ ও দয়ায় আমাদের উপর বৃষ্টি বর্ষিত হয়েছে।”","1"));
        duaItems.add(new DuaItems("অতিবৃষ্টি বন্ধের জন্য কিছু দো‘আ ", "اللَّهُمَّ حَوَالَيْنَا وَلاَ عَلَيْنَا، اللَّهُمَّ عَلَى الآكَامِ وَالظِّرَابِ، وَبُطُونِ الْأَوْدِيَةِ، وَمَنَابِتِ الشَّجَرِ.","আল্লা-হুম্মা হাওয়ালাইনা ওয়ালা ‘আলাইনা। আল্লা-হুম্মা আলাল-আ-কা-মি ওয়ায্যিরা-বি ওয়াবুতূনিল আওদিয়াতি ওয়ামানা-বিতিশ শাজারি"," “হে আল্লাহ! আমাদের পার্শ্ববর্তী এলাকায় (বর্ষণ করুন), আমাদের উপর নয়। হে আল্লাহ! উঁচু ভূমিতে, পাহাড়ে, উপত্যকার কোলে ও বনাঞ্চলে (বর্ষণ করুন)।”","1"));
        duaItems.add(new DuaItems("কেউ ঋণ দিলে তা পরিশোধের সময় দো‘আ ", "بارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ، إِنَّمَا جَزَاءُ السَّلَفِ الْحَمْدُ وَالأَدَاءُ","বা-রাকাল্লা-হু লাকা ফী আহলিকা ওয়া মা-লিকা, ইন্নামা জাযা-উস সালাফে আল-হামদু ওয়াল আদা-উ"," “আল্লাহ আপনার পরিবারে ও সম্পদে বরকত দান করুন। ঋণের প্রতিদান তো কৃতজ্ঞতা প্রকাশ ও (ঠিকভাবে) আদায়।”","1"));
        duaItems.add(new DuaItems("বাহনে আরোহণের দো‘আ ", "«بِسْمِ اللَّهِ، وَالْحَمْدُ للَّهِ ﴿سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ، وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ﴾، «الْحَمْدُ لِلَّهِ، الْحَمْدُ لِلَّهِ، الْحَمْدُ لِلَّهِ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، سُبْحَانَكَ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي؛ فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ».","বিস্মিল্লা-হি, আলহাম্দু লিল্লা-হি, সুব্হা-নাল্লাযী সাখখারা লানা হা-যা ওয়ামা কুন্না লাহু মুক্বরিনীন। ওয়া ইন্না ইলা রব্বিনা লামুনক্বালিবূন, আলহামদুলিল্লা-হ, আলহামদুলিল্লা-হ, আলহামদুলিল্লা-হ, আল্লা-হু আকবার, আল্লা-হু আকবার, আল্লা-হু আকবার, সুবহা-নাকাল্লা-হুম্মা ইন্নী যালামতু নাফসী ফাগফির লী। ফাইন্নাহু লা ইয়াগফিরুয্যুনূবা ইল্লা আনতা"," “আল্লাহ্র নামে; আর সকল প্রশংসা আল্লাহ্র জন্য। পবিত্র মহান সেই সত্তা, যিনি একে আমাদের জন্য বশীভূত করে দিয়েছেন, অন্যথায় আমরা একে বশীভূত করতে সক্ষম ছিলাম না। আর আমরা অবশ্যই প্রত্যাবর্তন করবো আমাদের রব্বের দিকে। সকল প্রশংসা আল্লাহ্র জন্য, সকল প্রশংসা আল্লাহ্র জন্য, সকল প্রশংসা আল্লাহ্র জন্য। আল্লাহ সবচেয়ে বড়, আল্লাহ সবচেয়ে বড়, আল্লাহ সবচেয়ে বড়। হে আল্লাহ! আপনি পবিত্র-মহান; আমি আমার নিজের উপর যুলুম করেছি, সুতরাং আপনি আমাকে মাফ করে দিন। কেননা, আপনি ছাড়া গুনাহ মাফ করার আর কেউ নেই।”","1"));
        duaItems.add(new DuaItems("সফরের দো‘আ ", "اَللّٰهُ أَكْبَرُ\n   \n" +
                "اَللّٰهُمَّ إِنَّا نَسْأَلُكَ فِيْ سَفَرِنَا هٰذَا الْبِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى، اَللّٰهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هٰذَا وَاطْوِ عَنَّا بُعْدَهُ، اَللّٰهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَلِيْفَةُ فِي الْأَهْلِ","আল্লা-হু আকবার(তিনবার বলবে) আল্লা-হুম্মা ইন্না নাস’আলুকা ফী সাফারিনা হা-যাল-বিররা ওয়াত্তাকওয়া, ওয়ামিনাল ‘আমালি মা তারদ্বা। আল্লা-হুম্মা হাউইন ‘আলাইনা সাফারানা হা-যা ওয়াতউই ‘আন্না বু‘দাহু। আল্লা-হুম্মা আনতাস সা-হিবু ফিস সাফারি ওয়াল-খালীফাতু ফিল আহ্লি"," হে আল্লাহ! আমরা এই সফরে আপনার কাছে চাই পূণ্য ও তাকওয়া এবং এমন কাজ যা আপনি পছন্দ করেন। হে আল্লাহ! আমাদের জন্য এই সফরকে সহজ করে দিন এবং এর দুরত্বকে আমাদের জন্য কমিয়ে দিন। হে আল্লাহ্! আপনিই সফরে আমাদের সাথী এবং আমাদের পরিবার-পরিজনের তত্ত্বাবধায়ণকারী।","1"));
        duaItems.add(new DuaItems("গ্রাম বা শহরে প্রবেশের দো‘আ", "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَمَا أَظْلَلْنَ، وَرَبَّ الأَرَضِينَ السَّبْعِ وَمَا أَقْلَلْنَ، وَرَبَّ الشَّياطِينِ وَمَا أَضْلَلْنَ، وَرَبَّ الرِّيَاحِ وَمَا ذَرَيْنَ، أَسْأَلُكَ خَيْرَ هَذِهِ الْقَرْيَةِ، وَخَيْرَ أَهْلِهَا، وَخَيْرَ مَا فِيهَا، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ أَهْلِهَا، وَشَرِّ مَا فِيهَا».","আল্লা-হুম্মা রব্বাস্ সামা-ওয়া-তিস্ সাব‘ঈ ওয়ামা আযলালনা, ওয়ারব্বাল আরাদ্বীনাস সাব‘ঈ ওয়ামা আক্বলালনা, ওয়া রব্বাশ শাইয়া-তী-নি ওয়ামা আদ্বলালনা, ওয়া রব্বাররিয়া-হি ওয়ামা যারাইনা, আস’আলুকা খাইরা হা-যিহিল কারইয়াতি ওয়া খাইরা আহলিহা ওয়া খাইরা মা ফীহা। ওয়া আ‘ঊযু বিকা মিন শাররিহা ওয়া শাররি আহলিহা ওয়া শাররি মা ফীহা"," হে আল্লাহ! সাত আসমান এবং তা যা কিছু ছায়া দিয়ে রেখেছে তার রব্ব! সাত যমীন এবং তা যা ধারণ করে রেখেছে তার রব্ব! শয়তানদের এবং ওদের দ্বারা পথভ্রষ্টদের রব্ব! বাতাসসমূহ এবং তা যা উড়িয়ে নেয় তার রব্ব! আমি আপনার নিকট চাই এ জনপদের কল্যাণ, এ জনপদবাসীর কল্যাণ এবং এর মাঝে যা আছে তার কল্যাণ। আর আমি আপনার নিকট আশ্রয় চাই এ জনপদের অনিষ্ট থেকে, তাতে বসবাসকারীদের অনিষ্ট থেকে এবং এর মাঝে যা আছে তার অনিষ্ট থেকে।(১) ................................ (১) হাকেম, আর তিনি একে সহীহ বলেছেন এবং ইমাম যাহাবী সেটা সমর্থন করেছেন ২/১০০; ইবনুস সুন্নী, হাদীস নং ৫২৪। তাছাড়া হাফেয ইবন হাজার তাঁর তাখরীজুল আযকার ৫/১৫৪, একে হাসান বলেছেন। আল্লামা ইবন বায রাহেমাহুল্লাহ বলেন, ‘হাদীসটি নাসাঈ হাসান সনদে বর্ণনা করেছেন।’ দেখুন, তুহফাতুল আখইয়ার, পৃ. ৩৭।","1"));
        duaItems.add(new DuaItems("বাজারে প্রবেশের দো‘আ ", "لَا إِلٰهَ إِلَّا اللّٰهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، يُحْيِيْ وَيُمِيْتُ، وَهُوَ حَيٌّ لَا يَمُوْتُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ ","লা ইলা-হা ইল্লাল্লা-হু ওয়াহ্দাহু লা শারীকালাহু লাহুল-মুলকু ওয়ালাহুল হামদু ইয়ুহঈ ওয়াইয়ুমীতু ওয়াহুয়া হায়্যুন লা ইয়ামূতু বিয়াদিহিল খাইরু ওয়া হুওয়া ‘আলা কুল্লি শাই’ইন ক্বাদীর"," আল্লাহ তাআলা মুসলিম উম্মাহকে বাজারে প্রবেশের সময় এ দোয়াটি পড়ে গুরুত্বপূর্ণ ফজিলত অর্জনের তাওফিক দান করুন। আমিন।","1"));
        duaItems.add(new DuaItems("বাহন হোঁচট খেলে পড়ার দো‘আ", "بِسْمِ اللّٰهِ ","বিসমিল্লা-হ"," পরম করুণাময় অসীম দয়ালু আল্লাহর নামে।","1"));
        duaItems.add(new DuaItems("মুক্বীম বা অবস্থানকারীদের জন্য মুসাফিরের দো‘আ", "أَسْتَوْدِعُكُمُ اللّٰهَ الَّذِيْ لَا تَضِيْعُ وَدَائِعُهُ","আস্তাউদি‘উ কুমুল্লা-হাল্লাযী লা তাদ্বী‘উ ওয়াদা-ই‘উহু"," আমি তোমাদেরকে আল্লাহ্র হেফাযতে রেখে যাচ্ছি, যাঁর কাছে রাখা আমানতসমূহ কখনও বিনষ্ট হয় না।","1"));
        duaItems.add(new DuaItems("রাত্রির শেষ প্রহরে মুসাফিরের দো‘আ", "سَمَّعَ سَامِعٌ بِحَمْدِ اللّٰهِ، وَحُسْنِ بَلَائِهِ عَلَيْنَا، رَبَّنَا صَاحِبْنَا، وَأَفْضِلْ عَلَيْنَا، عَائِذًا بِاللّٰهِ مِنَ النَّارِ \n","সাম্মা‘আ সা-মি‘উন বিহামদিল্লা-হ, ওয়া হুসনি বালা-ইহী ‘আলাইনা, রাব্বানা সা-হিবনা, ওয়া আফদিল ‘আলাইনা, ‘আ-ইযান বিল্লা-হি মিনান না-রী"," আমরা যে আল্লাহ্\u200Cর প্রশংসা করলাম, আর আমাদের উপর তাঁর উত্তম নেয়ামতের ঘোষণা দিলাম, তা একজন শ্রোতা আমার এ কথা শুনে অন্যের কাছে পৌঁছে দিক। হে আমাদের রব! আপনি আমাদের সাথী হোন, আর আমাদের উপর অনুগ্রহ বর্ষণ করুন। আগুন থেকে আল্লাহ্র কাছে আশ্রয়প্রার্থী হয়ে (এ দো‘আ করছি)।","1"));
        duaItems.add(new DuaItems("সফরে বা অন্য অবস্থায় কোনো ঘরে নামলে পড়ার দো‘আ ",
                "أَعُوْذُ بِكَلِمَاتِ اللّٰهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ \n","আ‘ঊযু বি কালিমা-তিল্লা-হিত তা-ম্মা-তি মিন শাররি মা খালাক্ব\n"," আল্লাহ্র পরিপূর্ণ কালেমাসমূহের ওসিলায় আমি তাঁর নিকট তাঁর সৃষ্টির ক্ষতি থেকে আশ্রয় চাই।","1"));



        //
        duaItems.add(new DuaItems("সফর থেকে ফেরার যিক্\u200Cর",
                "لَا إِلٰهَ إِلَّا اللّٰهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، آيِبُوْنَ، تَائِبُوْنَ، عَابِدُوْنَ، لِرَبِّنَا حَامِدُوْنَ، صَدَقَ اللّٰهُ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزَابَ وَحْدَهُ \n","লা ইলা-হা ইল্লাল্লা-হু ওয়াহদাহু লা শারীকা লাহু, লাহুল মুলকু ওয়া লাহুল হামদু, ওয়াহুয়া ‘আলা কুল্লি শাই’ইন ক্বাদীর, আ-ইবূনা, তা-ইবূনা, ‘আ-বিদূনা, লি রাব্বিনা হা-মিদূন। সাদাক্বাল্লা-হু ওয়া‘দাহু, ওয়া নাসারা ‘আবদাহু ওয়া হাযামাল আহযাবা ওয়াহদাহু\n"," একমাত্র আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তাঁর কোনো শরীক নেই; রাজত্ব তাঁরই, সমস্ত প্রশংসাও তাঁর; আর তিনি সকল কিছুর উপর ক্ষমতাবান। আমরা প্রত্যাবর্তনকারী, তওবাকারী, ইবাদতকারী এবং আমাদের রব্বের প্রশংসাকারী। আল্লাহ তাঁর ওয়াদা বাস্তবায়ন করেছেন, তিনি তাঁর বান্দাকে সাহায্য করেছেন, আর তিনি সকল বিরোধী দল-গোষ্ঠীকে একাই পরাস্ত করেছেন।\n","1"));
        duaItems.add(new DuaItems("আনন্দদায়ক অথবা অপছন্দনীয় কিছুর সম্মুখীন হলে যা বলবে", "اَلْحَمْدُ لِلّٰهِ الَّذِيْ بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ ","আলহামদু লিল্লা-হিল্লাযী বিনি‘মাতিহী তাতিম্মুস সা-লিহা-ত"," “আল্লাহ্\u200Cর জন্য সমস্ত প্রশংসা, যাঁর নেয়ামত দ্বারা সকল ভাল কিছু পরিপূর্ণ হয়।”","1"));
        duaItems.add(new DuaItems("যাকে আপনি গালি দিয়েছেন তার জন্য দো‘আ", "اَللّٰهُمَّ فَأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ فَاجْعَلْ ذَلِكَ لَهُ قُرْبَةً إِلَيْكَ يَوْمَ الْقِيَامَةِ ","আল্লা-হুম্মা ফাআইয়্যূমা মু’মিনিন্ সাবাবতুহু ফাজ্‘আল যা-লিকা লাহু কুরবাতান ইলাইকা ইয়াউমাল ক্বিয়া-মাতি"," রাসূলুল্লাহ্\u200C সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, হে আল্লাহ! যে মুমিনকেই আমি গালি দিয়েছি, তা তার জন্য কিয়ামতের দিন আপনার নৈকট্যের মাধ্যম করে দিন।\n","1"));
        duaItems.add(new DuaItems("কবর ও জাহান্নামের আযাব এবং জীবন, মৃত্যু ও দাজ্জালের ফিতনা থেকে আশ্রয় চাওয়ার দোআ", "\n" +
                "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَمِنْ عَذَابِ جَهَنَّمَ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيْحِ الدَّجَّالِ \n ","আল্লা-হুম্মা ইন্নী আ‘ঊযু বিকা মিন ‘আযা-বিল ক্বাবরি ওয়া মিন ‘আযা-বি জাহান্নামা, ওয়া মিন ফিতনাতিল মাহ্ইয়া ওয়াল মামা-তি, ওয়া মিন শাররি ফিতনাতিল মাসীহিদ দাজ্জা-ল\n"," হে আল্লাহ! আমি আপনার কাছে আশ্রয় চাচ্ছি কবরের আযাব থেকে, জাহান্নামের আযাব থেকে, জীবন-মৃত্যুর ফিতনা থেকে এবং মাসীহ দাজ্জালের ফিতনার অনিষ্টতা থেকে","1"));
        duaItems.add(new DuaItems("কৃপণতা, কাপুরুষতা, বার্ধক্য এবং ফিতনা থেকে আশ্রয় চাওয়ার দোআ", "\n" +
                "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْبُخْلِ، وَأَعُوْذُ بِكَ مِنَ الْجُبْنِ، وَأَعُوْذُ بِكَ مِنْ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، وَأَعُوْذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا وَعَذَابِ الْقَبْرِ\n","আল্লা-হুম্মা ইন্নী আ‘উযু বিকা মিনাল বুখলি, ওয়া ‘আউযু বিকা মিনাল জুবনি, ওয়া আ‘উযু বিকা মিন আন উরাদ্দা ইলা আরযালিল্ ‘উমুরি, ওয়া আ‘ঊযু বিকা মিন্ ফিতনাতিদ দুনইয়া ও আযা-বিল ক্বাবরি\n"," হে আল্লাহ! আমি আপনার আশ্রয় চাই কৃপণতা থেকে, আপনার আশ্রয় চাই কাপুরুষতা থেকে, আপনার আশ্রয় চাই চরম বার্ধক্যে উপনীত হওয়া থেকে, আর আপনার আশ্রয় চাই দুনিয়ার ফিতনা ও কবরের আযাব থেকে\n","1"));
        duaItems.add(new DuaItems("জাহান্নাম থেকে আশ্রয় এবং জান্নাত চাওয়ার দোআ", "اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ الْجَنَّةَ وَأَعُوْذُ بِكَ مِنَ النَّارِِ ","আল্লা-হুম্মা ইন্নী আসআলুকাল জান্নাতা ওয়া আ‘উযু বিকা মিনান্নার"," অর্থ:“হে আল্লাহ! আমাকে জাহান্নামের আগুন থেকে মুক্তি দাও”","1"));
        duaItems.add(new DuaItems("সালামের আগে শেষ তাশাহহুদের পরের দো‘আ ", "\n" +
                "اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ يَا اَللّٰهُ بِأَنَّكَ الْوَاحِدُ الْأَحَدُ الصَّمَدُ الَّذِيْ لَمْ يَلِدْ وَلَمْ يُوْلَدْ، وَلَمْ يَكُنْ لَّهُ كُفُوًا أَحَدٌ، أَنْ تَغْفِرَ لِيْ ذُنُوبِيْ إِنَّكَ أَنْتَ الْغَفُوْرُ الرَّحِّيْمُ \n","আল্লা-হুম্মা ইন্নী আসআলুকা ইয়া আল্লা-হু বিআন্নাকাল ওয়া-হিদুল আহাদুস্ সমাদুল্লাযী লাম ইয়ালিদ ওয়ালাম ইয়ূলাদ ওয়ালাম ইয়াকুল্লাহু কুফূওয়ান আহাদ, আন্ তাগফিরালী যুনূবী, ইন্নাকা আনতাল গাফূরুর রহীম"," “হে আল্লাহ! আমি আপনার কাছে আশ্রয় চাচ্ছি কবরের আযাব থেকে, জাহান্নামের আযাব থেকে, জীবন-মৃত্যুর ফিতনা থেকে এবং মাসীহ দাজ্জালের ফিতনার অনিষ্টতা থেকে”","1"));
        duaItems.add(new DuaItems("উপকারী জ্ঞান, পবিত্র রিযিক এবং কবুলযোগ্য আমলের দো'আ", "\n" +
                "اَللّٰهُمَّ إِنِّيْ أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا \n ","ফজর নামাযের সালাম ফিরানোর পর পড়বে, আল্লা-হুম্মা ইন্নী আস্আলুকা ‘ইলমান না-ফি‘আন্ ওয়া রিয্\u200Cকান ত্বায়্যিবান ওয়া ‘আমালান মুতাক্বাব্বালান\n" +
                "\n"
                ," \"হে আল্লাহ! আমি আপনার নিকট উপকারী জ্ঞান, পবিত্র রিযিক এবং কবুলযোগ্য আমল প্রার্থনা করি।\\n\"","1"));
        duaItems.add(new DuaItems("রাতে যখন পার্শ্ব পরিবর্তন করে তখন পড়ার দো‘আ", "لَا إِلٰهَ إِلَّا اللّٰهُ الْوَاحِدُ الْقَهَّارُ، رَبُّ السَّمَوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا الْعَزِيْزُ الْغَفَّارُ ","লা ইলা-হা ইল্লাল্লা-হুল ওয়াহিদুল কাহ্\u200Cহারু রব্বুস্ সামা-ওয়া-তি ওয়াল-আরদ্বি ওয়ামা বাইনাহুমাল-‘আযীযুল গাফ্\u200Cফার\n"," “মহাপ্রতাপশালী এক আল্লাহ ছাড়া আর কোনো হক্ব ইলাহ নেই। (তিনি) আসমানসমূহ, যমীন এবং এ দু’য়ের মধ্যস্থিত সবকিছুর রব্ব, প্রবলপরাক্রমশালী, পরম ক্ষমাশীল।”\n","1"));
        duaItems.add(new DuaItems("ঘুমন্ত অবস্থায় ভয় এবং একাকিত্বের অস্বস্তিতে পড়ার দো‘আ",
                "أَعُوْذُ بِكَلِمَاتِ اللّٰهِ التَّامَّاتِ مِنْ غَضَبِهِ وَعِقَابِهِ، وَشَرِّ عِبَادِهِ، وَمِنْ هَمَزَاتِ الشَّيَاطِيْنِ وَأَنْ يَحْضُرُوْنِ\n ","আ‘ঊযু বিকালিমা-তিল্লাহিত্তা-ম্মাতি মিন্ গাদ্বাবিহি ওয়া ইক্বা-বিহি ওয়া শাররি ‘ইবা-দিহি ওয়ামিন হামাযা-তিশ্\u200Cশায়া-ত্বীনি ওয়া আন ইয়াহ্\u200Cদুরূন\n"," “আমি আশ্রয় চাই আল্লাহ্\u200Cর পরিপূর্ণ কালামসমূহের অসীলায় তাঁর ক্রোধ থেকে, তাঁর শাস্তি থেকে, তাঁর বান্দাদের অনিষ্ট থেকে, শয়তানদের কুমন্ত্রণা থেকে এবং তাদের উপস্থিতি থেকে।","1"));
        duaItems.add(new DuaItems("বিত্\u200Cরের কুনুতের দো‘আ", "\n" +
                "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوْبَتِكَ، وَأَعُــوْذُ بِكَ مِنْكَ، لَا أُحْصِيْ ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ \n","আল্লা-হুম্মা ইন্নী আঊযুবিরিদ্বা-কা মিন সাখাত্বিকা, ওয়া বিমু‘আ-ফা-তিকা মিন ‘উক্বুবাতিকা, ওয়া আঊযু বিকা মিনকা, লা উহ্\u200Cসী সানা-আন আলাইকা, আনতা কামা আসনাইতা ‘আলা নাফসিকা\n"," “হে আল্লাহ! আমি আপনার সন্তুষ্টির মাধ্যমে অসন্তুষ্টি থেকে, আর আপনার নিরাপত্তার মাধ্যমে আপনার শাস্তি থেকে আশ্রয় চাই। আর আমি আপনার নিকটে আপনার (পাকড়াও) থেকে আশ্রয় চাই। আমি আপনার প্রশংসা গুনতে সক্ষম নই; আপনি সেরূপই, যেরূপ প্রশংসা আপনি নিজের জন্য করেছেন।”","1"));
        duaItems.add(new DuaItems("দুঃখ ও দুশ্চিন্তার সময় পড়ার দো‘আ ", "\n" +
                "اَللّٰهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ \n","আল্লা-হুম্মা ইন্নি আ‘ঊযু বিকা মিনাল হাম্মি ওয়াল হাযানি, ওয়াল ‘আজযি ওয়াল কাসালি, ওয়াল বুখলি ওয়াল জুবনি, ওয়া দালা‘ইদ দ্বাইনে ওয়া গালাবাতির রিজা-লি\n"," “হে আল্লাহ! নিশ্চয় আমি আপনার আশ্রয় নিচ্ছি দুশ্চিন্তা ও দুঃখ থেকে, অপারগতা ও অলসতা থেকে, কৃপণতা ও ভীরুতা থেকে, ঋণের ভার ও মানুষদের দমন-পীড়ন থেকে।”\n","1"));
        duaItems.add(new DuaItems("দুর্দশাগ্রস্ত ব্যক্তির দো‘আ ", "\n" +
                "لَا إِلٰهَ إِلَّا اللّٰهُ الْعَظِيْمُ الْحَلِيْمُ، لَا إِلٰهَ إِلَّا اللّٰهُ رَبُّ الْعَرْشِ الْعَظِيْمِ، لَا إِلٰهَ إِلَّا اللّٰهُ رَبُّ السَّمَوَاتِ وَرَبُّ الْأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيْمِ \n","লা ইলা-হা ইল্লাল্লা-হুল ‘আযীমূল হালীম। লা ইলা-হা ইল্লাল্লা-হু রব্বুল ‘আরশিল ‘আযীম। লা ইলাহা ইল্লাল্লা-হু রব্বুস সামা-ওয়া-তি ওয়া রব্বুল আরদ্বি ওয়া রব্বুল ‘আরশিল কারীম"," “আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তিনি মহান ও সহিষ্ণু। ‘আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তিনি মহান আরশের রব্ব। আল্লাহ ছাড়া কোনো হক্ব ইলাহ নেই, তিনি আসমানসমূহের রব্ব, যমীনের রব্ব এবং সম্মানিত আরশের রব্ব।”","1"));
        duaItems.add(new DuaItems("শত্রু এবং শক্তিধর ব্যক্তির সাক্ষাতকালে দো‘আ ", "اَللّٰهُمَّ إِنَّا نَجْعَلُكَ فِيْ نُحُوْرِهِم، وَنَعُوْذُ بِكَ مِنْ شُرُوْرِهِمْ","আল্লা-হুম্মা ইন্না নাজ্‘আলুকা ফী নুহূরিহিম ওয়া না‘উযু বিকা মিন শুরূরিহিম\n","“হে আল্লাহ! আমরা আপনাকে তাদের গলদেশে রাখছি এবং তাদের অনিষ্ট থেকে আপনার নিকট আশ্রয় প্রার্থনা করছি।”","1"));
        duaItems.add(new DuaItems("শাসকের অত্যাচারের ভয় করলে পড়ার দো‘আ ", "\n" +
                "اَللّٰهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ، وَرَبَّ الْعَرْشِ الْعَظِيْمِ، كُنْ لِيْ جَارًا مِنْ فُلَانِ بْنِ فُلَانٍ، وَأَحْزَابِهِ مِنْ خَلَائِقِكَ، أَنْ يَفْرُطَ عَلَيَّ أَحَدٌ مِنْهُمْ أَوْ يَطْغَى، عَزَّ جَارُكَ، وَجَلَّ ثَنَاؤُكَ، وَلَا إِلٰهَ إِلَّا أَنْتَ \n","আল্লা-হুম্মা রব্বাস্ সামা-ওয়া-তিস সাব‘ঈ, ওয়া রব্বাল ‘আরশিল ‘আযীম। কুন লী জারান মিন্ ফুলানিবনি ফুলানিন, ওয়া আহযাবিহী মিন খালা-য়েক্বিকা, আঁই ইয়াফরুত্বা ‘আলাইয়্যা আহাদুম মিনহুম আও ইয়াত্বগা, আয্যা জা-রুকা, ওয়া জাল্লা সানা-উকা, ওয়া লা ইলা-হা ইল্লা আনতা\n"," “হে আল্লাহ, সাত আসমানের রব্ব! মহান আরশের রব্ব! আপনার সৃষ্টিকুলের মধ্য থেকে অমুকের পুত্র অমুকের বিপক্ষে এবং তার বাহিনীর বিরুদ্ধে আপনি আমার আশ্রয়দানকারী হোন; যাতে তাদের কেউ আমার উপর দ্রুত আক্রমণ বা সীমালঙ্ঘন করতে না পারে। আপনার আশ্রিত তো শক্তিশালী, আপনার প্রশংসা তো অতি মহান। আর আপনি ছাড়া কোনো হক্ব ইলাহ নেই।”\n","1"));

        duaItems.add(new DuaItems("ঈমানের মধ্যে সন্দেহে পতিত ব্যক্তির দো‘আ ", "\n" +
                "أَعُوْذُ بِاللّٰهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ \n","আ‘ঊযু বিল্লাহি মিনাশ্-শাইত্বা-নির রাজীম\n","  আল্লাহ্\u200Cর কাছে আশ্রয় প্রার্থনা করবে \n" +
                "\n" +
                "যে সন্দেহে নিপতিত হয়েছে তা দূর করবে। \n" +
                "\n" +
                "\n" +
                "বলবে,\n" +
                "\n" +
                "آمَنْتُ بِاللّٰهِ وَرُسُلِهِ \n" +
                "\n" +
                "\n" +
                "আ-মানতু বিল্লা-হি ওয়া রুসুলিহি\n" +
                "\n" +
                "“আমি আল্লাহ ও তাঁর রাসূলগণের উপর ঈমান আনলাম।\n","1"));
        duaItems.add(new DuaItems("ঋণ মুক্তির জন্য দো‘আ ", "\n" +
                "اَللّٰهُمَّ اكْفِنِيْ بِحَلاَلِكَ عَنْ حَرَامِكَ، وَأَغْنِنِيْ بِفَضْلِكَ عَمَّنْ سِوَاكَ \n","আল্লা-হুম্মাকফিনী বিহালা-লিকা ‘আন হারা-মিকা ওয়া আগনিনী বিফাদ্বলিকা ‘আম্মান সিওয়া-ক\n"," “হে আল্লাহ! আপনি আমাকে আপনার হালালের সাহায্যে হারাম থেকে বাঁচান। এবং আপনার অনুগ্রহ দ্বারা আপনি ব্যতীত অন্যের মুখাপেক্ষিতা হতে বাঁচান।\n","1"));
        duaItems.add(new DuaItems("শত্রুর উপর বদ-দো‘আ", "\n" +
                "اَللّٰهُمَّ مُنْزِلَ الْكِتَابِ، سَرِيْعَ الْحِسَابِ، اَهْزِمِ الْأَحْزَابَ، اَللّٰهُمَّ اهْزِمْهُمْ وَزَلْزِلْهُمْ\n","আল্লা-হুম্মা মুনযিলাল কিতা-বি সারী‘আল হিসা-বি ইহযিমিল আহযা-ব। আল্লা-হুম্মাহযিমহুম ওয়া যালযিলহুম\n"," হে আল্লাহ, কিতাব নাযিলকারী, দ্রুত হিসাব গ্রহণকারী! আপনি শত্রুবাহিনীকে পরাভূত করুন। হে আল্লাহ! আপনি তাদেরকে পরাজিত করুন এবং তাদের মধ্যে ত্রাস সৃষ্টি করে দিন।\n","1"));
        duaItems.add(new DuaItems("সালাতে ও কিরাআতে শয়তানের কুমন্ত্রণায় পতিত ব্যক্তির দো‘আ", "\n" +
                "أَعُوْذُ بِاللّٰهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ \n","আ‘ঊযু বিল্লা-হি মিনাশ শাইত্বানির রাজীম\n"," বিতাড়িত শয়তান থেকে আমি আল্লাহ্\u200Cর আশ্রয় নিচ্ছি।\n" +
                "\n" +
                "অতঃপর বাম দিকে তিনবার থুতু ফেলবে। \n","1"));
        duaItems.add(new DuaItems("কঠিন কাজে পতিত ব্যক্তির দো‘আ", "\n" +
                "اَللّٰهُمَّ لَا سَهْلَ إِلَّا مَا جَعَلْتَهُ سَهْلاً، وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذَا شِئْتَ سَهْلاً\n","আল্লা-হুম্মা লা সাহ্\u200Cলা ইল্লা মা জা‘আলতাহু সাহ্\u200Cলান, ওয়া আনতা তাজ্‘আলুল হাযনা ইযা শি’তা সাহ্\u200Cলান\n"," “হে আল্লাহ! আপনি যা সহজ করেছেন তা ছাড়া কোনো কিছুই সহজ নয়। আর যখন আপনি ইচ্ছা করেন তখন কঠিনকেও সহজ করে দেন।”","1"));
        duaItems.add(new DuaItems("যখন অনাকাঙ্খিত কিছু ঘটে, বা যা করতে চায় তাতে বাধাপ্রাপ্ত হয়, তখন পড়ার দো‘আ", "قَدَرُ اللّٰهِ، وَمَا شَاءَ فَعَلَ","কাদারুল্লা-হ, ওয়ামা শা-আ ফা‘আলা\n"," এটি আল্লাহ্\u200Cর ফয়সালা, আর তিনি যা ইচ্ছা করেছেন।","1"));
        duaItems.add(new DuaItems("রোগী দেখতে গিয়ে তার জন্য দো‘আ ", "لَا بَأْسَ طَهُوْرٌ إِنْ شَاءَ اللّٰهُ","লা বা’সা তহুরুন ইন শা-আল্লা-হ\n"," অর্থ : ‘ভয় নেই, আল্লাহর মেহেরবানীতে আরোগ্য লাভ করবে ইনশাআল্লাহ (বুখারি, মুসলিম, মিশকাত)","1"));
        duaItems.add(new DuaItems("জীবনের আশা ছেড়ে দেওয়া রোগীর দো‘আ ", "\n" +
                "اَللّٰهُمَّ اغْفِرْ لِيْ، وَارْحَمْنِيْ، وَأَلْحِقْنِيْ بِالرَّفِيْقِ الْأَعْلَى \n","আল্লা-হুম্মাগফিরলী ওয়ারহামনী ওয়া আলহিক্বনী বির রফীক্বিল আ‘লা","“হে আল্লাহ! আমাকে ক্ষমা করুন, আমার প্রতি দয়া করুন এবং আমাকে সর্বোচ্চ বন্ধুর সঙ্গ পাইয়ে দিন।”","1"));
        duaItems.add(new DuaItems("কোনো মুসিবতে পতিত ব্যক্তির দো‘আ", "\n" +
                "إِنَّا لِلّٰهِ وَإِنَّا إِلَيْهِ رَاجِعُوْنَ، اَللّٰهُمَّ أَجُرْنِيْ فِيْ مُصِيْبَتِيْ، وَأَخْلِفْ لِيْ خَيْرًا مِّنْهَا\n","ইন্না লিল্লা-হি ওয়া ইন্না ইলাইহি রাজি‘উন। আল্লা-হুম্মা আজুরনী ফী মুসীবাতী ওয়া আখলিফ লী খাইরাম মিনহা\n"," “আমরা তো আল্লাহ্\u200Cরই। আর নিশ্চয় আমরা তাঁর দিকেই প্রত্যাবর্তনকারী। হে আল্লাহ! আমাকে আমার বিপদে সওয়াব দিন এবং আমার জন্য তার চেয়েও উত্তম কিছু স্থলাভিষিক্ত করে দিন।”","1"));
        duaItems.add(new DuaItems("মৃত ব্যক্তির চোখ বন্ধ করানোর দো‘আ", "اَللّٰهُمَّ اغْفِرْ لِفُلَانٍ (بِاِسْمِهِ) وَارْفَعْ دَرَجَتَهُ فِي الْمَهْدِيِّيْنَ، وَاخْلُفْهُ فِيْ عَقِبِهِ فِي الْغَابِرِيْنَ، وَاغْفِرْ لَنَا وَلَهُ يَا رَبَّ الْعَالَمِيْنَ، وَافْسَحْ لَهُ فِي قَبْرِهِ، وَنَوِّرْ لَهُ فِيْهِ","আল্লা-হুম্মাগফির লি ফুলা-নিন (মৃতের নাম বলবে) ওয়ারফা‘ দারাজাতাহু ফিল মাহদিয়্যীন, ওয়াখলুফহু ফী ‘আক্বিবিহী ফিল গা-বিরীন, ওয়াগফির লানা ওয়ালাহু ইয়া রব্বাল আ-লামীন। ওয়াফসাহ্\u200C লাহু ফী ক্বাবরিহী ওয়া নাউইর লাহু ফী-হি\n","অর্থঃ হে আল্লাহ! আপনি অমুককে (মৃত ব্যক্তির নাম ) ক্ষমা করুন; যারা হেদায়াত লাভ করেছে, তাদের মাঝে তার মর্যাদা উঁচু করে দিন; যারা রয়ে গেছে তাদের মাঝে তার বংশধরদের ক্ষেত্রে আপনি তার প্রতিনিধি হোন। হে সৃষ্টিকুলের রব! আমাদের ও তার গুনাহ মাফ করে দিন। তার জন্য তার কবরকে প্রশস্ত করে দিন এবং তার জন্য তা আলোকময় করে দিন।","1"));
        duaItems.add(new DuaItems(" নাবালক শিশুদের জন্য জানাযার সালাতে দো‘আ", "\n" +
                "اَللّٰهُمَّ أَعِذْهُ مِنْ عَذَابِ الْقَبْرِ\n","আল্লা-হুম্মা আ‘য়িযহু মিন আযা-বিল ক্বাবরি\n","হে আল্লাহ! এ শিশুকে কবরের আযাব থেকে রক্ষা করুন।","1"));
        duaItems.add(new DuaItems("শোকার্তদের সান্ত্বনা দেওয়ার দো‘আ", "إِنَّ لِلّٰهِ مَا أَخَذَ، وَلَهُ مَا أَعْطَى، وَكُلُّ شَيْءٍ عِنْدَهُ بِأَجَلٍ مُسَمًّى فَلْتَصْبِرْ وَلْتَحْتَسِبْ","ইন্না লিল্লা-হি মা আখাযা, ওয়ালাহু মা আ‘তা, ওয়া কুল্লু শাই’ইন ‘ইনদাহু বিআজালিম মুসাম্মা, ফালতাসবির ওয়াল তাহতাসিব\n"," “নিশ্চয় যা নিয়ে গেছেন আল্লাহ্\u200C তা তাঁরই, আর যা কিছু প্রদান করেছেন তাও তাঁর। তাঁর কাছে সব কিছুর একটি নির্দিষ্ট সময় রয়েছে। কাজেই সবর করা এবং সওয়াবের আশা করা উচিৎ।”","1"));
        duaItems.add(new DuaItems("মৃতকে কবরে প্রবেশ করানোর দো‘আ", "بِسْمِ اللّٰهِ وَعَلَى سُنَّةِ رَسُوْلِ اللّٰهِ ","বিসমিল্লা-হি ওয়া আলা সুন্নাতি রাসুলিল্লা-হি","‘আল্লাহর নামে এবং রাসূলুল্লাহর মিল্লাতের উপর।’ তার সনদও বিশুদ্ধ।","1"));



    }

    @Override
    public void onViewCreated( View view, Bundle savedInstanceState) {
        super.onViewCreated(view, savedInstanceState);
        recyclerView=view.findViewById(R.id.dua_recyclervw);
        layoutManager=new LinearLayoutManager(getContext());
        layoutManager.setOrientation(RecyclerView.VERTICAL);
        recyclerView.setLayoutManager(layoutManager);

        adapter=new DuaListAdapter(duaItems);
        recyclerView.setAdapter(adapter);
        adapter.notifyDataSetChanged();


        backBtn=view.findViewById(R.id.bck_btn2);

        backBtn.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                //go back to previous fragment
                Fragment someFragment = new HomeFragment();
                FragmentTransaction transaction = getFragmentManager().beginTransaction();
                transaction.replace(R.id.main_frame_bg, someFragment, "Go back to home");
                transaction.addToBackStack("Go to home");

                transaction.commit();

            }
        });

    }

}