package com.example.custombottomnavigation.fragments;

import android.os.Bundle;

import androidx.annotation.NonNull;
import androidx.annotation.Nullable;
import androidx.fragment.app.Fragment;
import androidx.fragment.app.FragmentTransaction;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.ImageView;

import com.example.custombottomnavigation.HomeFragment;
import com.example.custombottomnavigation.MainActivity;
import com.example.custombottomnavigation.R;
import com.example.custombottomnavigation.adapter.DuaListAdapter;
import com.example.custombottomnavigation.adapter.HazzListAdapter;
import com.example.custombottomnavigation.models.DuaItems;

import java.util.ArrayList;
import java.util.List;


public class HazzFragment extends Fragment {
    RecyclerView recyclerView;
    LinearLayoutManager layoutManager;
    List<DuaItems> duaItems;
    HazzListAdapter adapter;
    ImageView backBtn;


    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        // Inflate the layout for this fragment
        return inflater.inflate(R.layout.fragment_hazz, container, false);
    }

    @Override
    public void onViewCreated( View view,Bundle savedInstanceState) {
        super.onViewCreated(view, savedInstanceState);
        //HIDE TOOLBAR
        MainActivity.toolbar.setVisibility(View.GONE);

        //       show all List Hazz Data
        initData();



        recyclerView=view.findViewById(R.id.hazz_recyclervw);
        layoutManager=new LinearLayoutManager(getContext());
        layoutManager.setOrientation(RecyclerView.VERTICAL);
        recyclerView.setLayoutManager(layoutManager);

        adapter=new HazzListAdapter(duaItems);
        recyclerView.setAdapter(adapter);
        adapter.notifyDataSetChanged();




        backBtn=view.findViewById(R.id.bck_btn2);
        backBtn.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                //go back to previous fragment
                Fragment someFragment = new HomeFragment();
                FragmentTransaction transaction = getFragmentManager().beginTransaction();
                transaction.replace(R.id.main_frame_bg, someFragment, "Go back to home");
                transaction.addToBackStack("Go to home");
                transaction.commit();
            }
        });
    }

    private void initData() {
        duaItems = new ArrayList<>();
        duaItems.add(new DuaItems("হজ্জের ফরজ ৩টি", "1", "১। ইহরাম বাধা \n ২। উ’কুফে আ’রাফা (আরাফাতের ময়দানে অবস্থান) \n ৩। তাওয়াফুয্ যিয়ারাত", "1", "1"));
        duaItems.add(new DuaItems("হজ্জের ওয়াজিব ৬টি", "1", "(১) ‘সাফা ও মারওয়া’ পাহাড় দ্বয়ের মাঝে ৭ বার সায়ী করা।\n" +
                "(২) অকুফে মুযদালিফায় (৯ই জিলহজ্জ) অর্থাৎ সুবহে সাদিক থেকে সুর্যদয় পর্যন্ত একমুহুর্তের জন্য\n" +
                "হলেও অবস্থান করা।\n" +
                "(৩) মিনায় তিন শয়তান (জামারাত) সমূহকে পাথর নিপে করা।\n" +
                "(৪) ‘হজ্জে তামাত্তু’ ও ‘কি্বরান’ কারীগণ ‘হজ্জ’ সমাপনের জন্য দমে শোকর করা।\n" +
                "(৫) এহরাম খোলার পূর্বে মাথার চুল মুন্ডানো বা ছাটা।\n" +
                "(৬) মক্কার বাইরের লোকদের জন্য তাওয়াফে বিদা অর্থাৎ মক্কা থেকে বিদায়কালীন তাওয়াফ করা।\n" +
                "এছাড়া আর যে সমস্ত আমল রয়েছে সব সুন্নাত অথবা মুস্তাহাব।", "1", "1"));
        duaItems.add(new DuaItems("ওমরাহর ফরজ, ওয়াজিব", "1", "দুইটি ফরজ: (১) ইহরাম পরিধান করা (২) তাওয়াফ\n" +
                "দুইটি ওয়াজিব: (১) সাফা ও মারওয়া মধ্যবর্তী (সবুজ বাতি) স্থানে সাতবার সায়ী করা (২) মাথার চুল\n" +
                "মুন্ডানো বা ছাটা।", "1", "1"));
        duaItems.add(new DuaItems("তালবিয়া", "1", "”লাব্বাঈক আল্লাহুম্মা লাব্বাঈক, লাব্বাঈক, লা-শারীকা-লাকা লাব্বাঈক, ইন্নাল হামদা ওয়ান্ নি’মাতা লাকা ওয়াল-মুল্ক, লা শারীকালাক।”\n" +
                "অর্থ: আমি হাজির হে আল্লাহ! আমি উপস্থিত! আপনার ডাকে সাড়া দিতে আমি হাজির। আপনার কোন অংশীদার নেই। নিঃসন্দেহে সমস্ত প্রশংসা ও সম্পদরাজি আপনার এবং একচ্ছত্র আধিপত্য আপনার।\n" +
                "আপনার কোন অংশীদার নেই।", "1", "1"));

        duaItems.add(new DuaItems("ইহরাম অবস্থায় নিষিদ্ধ কাজ", "1", "(১) সেলাইযুক্ত যে কোন কাপড় বা জুতা ব্যবহার, এক্ষেত্রে স্পঞ্জ সেন্ডেলের ব্যবহার করা।\n" +
                "(২) মস্তক ও মুখমন্ডল (ইহরামের কাপড়সহ যে কোন কাপড় দ্বারা) ঢাকা,\n" +
                "(৩) পায়ের পিঠ ঢেকে যায় এমন জুতা পরা।\n" +
                "(৪) চুলকাটা বা ছিড়ে ফেলা,\n" +
                "(৫) নখকাটা,\n" +
                "(৬) ঘ্রানযুক্ত তৈল বা আতর লাগানো।\n" +
                "(৭) স্ত্রীর সঙ্গে সংগম করা।\n" +
                "(৮) যৌন উত্তেজনামূলক কোন আচরণ বা কোন কথা বলা।\n" +
                "(৯) শিকার করা।\n" +
                "(১০) ঝগড়া বিবাদ বা যুদ্ধ করা।\n" +
                "(১১) চুল দাড়িতে চিরুনী বা আঙ্গুলী চালনা করা, যাতে ছিড়ার আশংকা থাকে।\n" +
                "(১২) শরীরে সাবান লাগানো।\n" +
                "(১৩) উকুন, ছারপোকা, মশা ও মাছিসহ কোন জীবজন্তু হত্যা করা বা মারা।\n" +
                "(১৪) কোন গুনাহের কাজ করা, ইত্যাদি।", "1", "1"));
        duaItems.add(new DuaItems("প্রথম প্রকার হজ্জে ইফরাদ", "1", "বর্ণনা: ওমরাহ্ ব্যতিত শুধু হজ্জের জন্য ইহরাম বাঁধা এবং হজ্জের সাথে ওমরাহকে না মিলানো। (বদলী হজ্জের জন্যও এই হজ্জ)।\n" +
                "নিয়্যাত: আল্লাহুমা ইন্নী উরীদুল হাজ্জা ফায়াসছির হুলিওয়াতা কাব্বালহুমিনি্ন। (বাংলা নিয়ত- আল্লাহ আমি ইফরাদ হজ্জের উদ্দেশ্যে আপনার সন্তুষ্টির জন্য ইহরাম বাধলাম। তা সহজ করে দিন ও কবুল করে নিন)।", "1", "1"));
        duaItems.add(new DuaItems("দ্বিতীয় প্রকার হজ্জে কি্বরান", "1", "বর্ণনা: একত্রে একই স্থান থেকে হজ্জ ও ওমরার নিয়্যাত করে হজ্জের সাথে ওমরাহকে মিলানো এবং একই ইহ্রামে উভয়টি আদায় করা।\n" +
                "নিয়্যাত: আল্লাহুমা ইন্নী উরীদুল উ’মরাতা ফায়াচ্ছির লী-ওয়াতাক্াব্বাল মিন্নী। বাংলা নিয়ত- হে আল্লাহ আমি আপনার উদ্দেশ্যে হজ্জে কি্বরানের জন্য ইহরাম বাধলাম তা সহজ করে দিন ও কবুল করে নিন।", "1", "1"));
        duaItems.add(new DuaItems("তৃতীয় প্রকার হজ্জে তামাত্তু", "1", "বর্ণনা: একই সফরে পৃথক পৃথক ভাবে ‘ইহরাম’ পরিধান করে ‘হজ্জ ও ওমরাহ’ আদায় করা। প্রথম ইহ্রামে ওমরাহর নিয়্যাত করে তা পালন শেষে চুল কেটে ‘ইহরাম’ খুলে হালাল হয়ে দ্বিতীয় বার নতুন করে হজ্জের নিয়্যাতে ৮ই জিলহজ্জ ‘মক্ক শরীফ’ থেকে হজ্জের জন্য ইহরাম বাধা। তামাত্তু করার ইচ্ছা থাকলে প্রথমে ওমরার নিয়্যাত করে এহরাম বাঁধুন।", "1", "1"));


        duaItems.add(new DuaItems("শুধু ওমরাহর নিয়্যাত", "1", "আল্লাহুমা ইন্নী উরীদুল উম’রাতা ফায়াচ্ছির লী-ওয়াতাক্াব্বাল মিন্নী। বাংলা নিয়ত- হে আল্লাহ আমি ওমরাহ্ পালনের জন্য ইহরাম বাধলাম তা সহজ করে দিন এবং কবুল করে নিন।", "1", "1"));

        duaItems.add(new DuaItems("শুধু হজ্জের নিয়্যাত", "1", "আল্লাহুম্মা ইন্নী উরীদুল হাজ্জা ফায়াচ্ছিরহু-লী অ-তাকাব্বালহু মিন্নী। বাংলা নিয়ত- হে আল্লাহ আমি পবিত্র হজ্জ পালনের জন্য ইহরাম বেধে নিয়ত করলাম তা সহজ করে দিন এবং কবুল করে নিন।", "1", "1"));

        duaItems.add(new DuaItems("তাওয়াফের বিবরণ", "1", "হাজীদের সর্বপ্রথম কাজই হলো (তামাত্তু ও ক্বেরান কারীগণ) নিজের মালছামানগুছিয়ে রেখে পাকপবিত্র হয়ে মোটেই দেরী না করে ‘হারাম শরীফে’ হাজিরা দেওয়া এবং ‘তাওয়াফ’ করা। ওমরাহ এবং হজ্জের তাওয়াফ ব্যাতিত নফল তাওয়াফ ও করা যায়। যেমন: রাসূল (দঃ), সাহাবা-আওলিয়া, আহ্লে বাইত, মা-বাবা, পীর-উস্তাদ ও অন্যান্য মুরুব্বী বা সন্তানদের স্মরনে বা তাঁদের নামে তাওয়াফ করা।", "1", "1"));

        duaItems.add(new DuaItems("তাওয়াফের ওয়াজিব সমূহ", "1", "(১) শরীর পাক-সাফ রাখা, ওজু করা। মহিলাদের হায়েজ নেফাছ অবস্থায় তাওয়াফ করা জায়েজ নাই।\n" +
                "(২) ছতর ঢাকা। অর্থাৎ যেটুকু ঢাকা প্রত্যেক পুরুষ-নারীর জন্য ফরজ।\n" +
                "(৩) ‘হাতীমে কা’বার’ বাইরে থেকে ‘তাওয়াফ’ করা।\n" +
                "(৪) পায়ে হেঁটে ‘তাওয়াফ’ করা। অম ব্যক্তি খাটিয়ার মাধ্যমে ‘তাওয়াফ’ করতে পারেন।\n" +
                "(৫) ‘হাজ্রে আস্ওয়াদ’ থেকে শুরু করে ডানদিক দিয়ে ‘তাওয়াফ’ শুরু করা।\n" +
                "(৬) এক নাগাড়ে বিরতিহীন ভাবে ‘সাতবার চক্কর’ দিয়ে ‘তাওয়াফ’ পূর্ণ করা।\n" +
                "(৭) ‘সাত চক্করে’ এক ‘তাওয়াফ’, এটা পূর্ণ হলেই ‘তাওয়াফের’ নামাজ পড়া।", "1", "1"));

        duaItems.add(new DuaItems("তাওয়াফের সুন্নত কার্যাবলী", "1", "(১) ‘তাওয়াফে’র শুরুতে ‘হাজারে আসওয়াদ’ এর দিকে মুখ করা।\n" +
                "(২) সম্ভব হলে ‘হাজ্রে আস্ওয়াদ’ চুম্বন করা। নতুবা হাত দ্বারা দূর থেকে ইশারা করা, এবং মুখে ‘বিসমিল্লাহি আল্লাহু আক্বার ওয়ালিল্লাহিল হ্ামদ’ বলা।\n" +
                "(৩) ‘হা্জ্রে অস্ওয়াদ’ বরাবর দাঁড়িয়ে তাকবীরে তাহরিমা’র ন্যায় উভয় হাত সিনা পর্যন্ত উঠান।\n" +
                "(৪) যে ‘তাওয়াফে’র পরে ‘সাঈ’ আছে তাতে ‘এযতেবা’ করা। অর্থাৎ ইহরামের চাদরের (উপরের অংশের) দুই মাথা ডান বগলের নিচ দিয়ে বাম কাঁধের উপর ফেলে দেওয়া।\n" +
                "(৫) ‘সাঈ’ যুক্ত ‘তাওয়াফে’র প্রথম তিন চক্করে ‘রমল’ করা। অথর্াৎ বীরের মত হেলে দুলে জোর ক্বদমে (একের পর এক পা ফেলে) চলা।\n" +
                "(৬) বাকী চার চক্কর সাধারণ গতিতে (ধীরে ধীরে) সম্পন্ন করা।\n" +
                "(৭) প্রত্যেক চক্কর তাওয়াফ শেষ করে এবং শেষ চক্করেরও পরে ‘হাজ্রে অস্ওয়াদ’কে চুম্বন করা।\n" +
                "সম্ভব না হলে দূর থেকে ইশারা করে বিসমিল্লাহে আল্লাহ আকবর ওয়ালিল্লাহিল হামদ্”দোয়াটি পাঠ করা এবং ৩ নং নিয়মের ন্যায় দাড়িয়ে ইশারা করে ‘তাওয়াফ’ শেষ করা।", "1", "1"));

        duaItems.add(new DuaItems("তাওয়াফের নিয়্যাত", "1", "আল্লাহুম্মা ইন্নী উরীদু তাওয়াফা বাইতিকাল হারাম ফায়াচ্ছিরহু-লী, ওয়া তাক্বাব্বাল-হু-মিন্নী, সাবাআ’তা আশ্ওয়াতি্বন লিল্লাহি তায়া’লা। বাংলায় নিয়ত- হে আল্লাহ আমি তাওয়াফ পালনের জন্য নিয়ত করলাম।", "1", "1"));

        duaItems.add(new DuaItems("সায়ীর নিয়ম", "1", "‘হজ্জ ও ওমরাহ’ ছাড়া নফল ‘তাওয়াফে’র কোন সায়ী নাই। কারো নামে ওমরাহ করতে হলেও সায়ী করতে হবে। সায়ী অর্থ দৌড়ানো। এটা ‘ছাফা’ পাহাড় থেকে প্রথমে শুরু করতে হবে। ছাফা থেকে মারওয়া।মারওয়া থেকে ছাফায়। এভাবে সাতবার সায়ীর সময় প্রথম তিন চক্কর সবুজ বাতির মাঝের অংশটুকু দৌড়ে দৌড়ে হেলে দুলে যাওয়া সুন্নাত (পুরুষদের জন্য)। পরের চার চক্কর সাধারণ গতিতে সম্পন্ন করতে হবে।", "1", "1"));

        duaItems.add(new DuaItems("সায়ীর সহজ দোয়া", "1", "সুবহানাল্লাহি ওয়াল হামদু লিল্লাহি ওয়া লা ইলাহা ইল্লাল্লাহু ওয়াল্লাহু আকবার ওয়া লা-হাওলা, ওয়ালা কুওয়াতা ইল্লাবিল্লাহিল আ’লিয়্যিল আ’যীম, রাবি্বগফির ওয়ারহাম ওয়াআনতাল আ-আজ্জুল আকরাম।", "1", "1"));

        duaItems.add(new DuaItems("সায়ীর কুরআনী দোয়া", "1", "‘ইন্নাছ্ ছাফা ওয়াল মারওয়াতা মিন্ শাআ’ইরিল্লাহ্ ফামান হাজ্জাল বাইতা আও-ই’ তামারা ফালা জুনাহা আ’লাইহি আইয়াত্ত্বাওয়াফা বিহিমা ওমান তাত্বাওয়াআ খাইরান ফা-ইন্নাল্লাহা শাকিরুণ আ’লীম।” উপরোক্ত দুই দোয়া সাতবার চক্করের সময় হাটতে চলতে পড়তে হবে। পরেরটি না পারলে উপরেরটিই যথেষ্ট হবে।", "1", "1"));

        duaItems.add(new DuaItems("১ম প্রকার হজ্জে ইফরাদের ১১টি জরুরী কাজ", "1", "৩টি ফরজ(১) ইহরাম (শুধু হজ্জের জন্য)।\n" +
                "(২) ৯ই জিলহজ্জ উ’কুফে আ’রাফা (সূর্য হেলার পর থেকে সুর্যাস্ত পর্যন্ত)।\n" +
                "(৩) ১০ থেকে ১২ই জিলহজ্জ তাওয়াফে যিয়ারাত তবে ১০ই জি্বলহজ্ব তারিখই উত্তম।\n" +
                "(৪) অকুফে মুযদালেফায় ১০ই জিলহজ্জ সুবহে সাদেক সূর্য উদয় পর্যন্ত।\n" +
                "(৫) ১০ই জিলহজ্জ বড় শয়তানকে (জামারাতে আক্কাবায়) ৭টি কঙ্কর মারা। সুর্য হেলার পূর্বে দুপুর ১২টার আগে সুন্নত।\n" +
                "(৬) মাথা মুন্ডানো তবে দম দিতে হবে।\n" +
                "(৭) সায়ী ৯ তারিখের পূর্বে বা পরে) করে দিবেন।\n" +
                "(৮) ১১ তারিখে তিন শয়তানকে (প্রথম ছোট/মেঝ ও পড়ে বড়) ৭ক্ম৩=২১টি পাথর মারা।\n" +
                "(৯) ১২ তারিখে অনুরূপ তিন শয়তানকে ৭ক্ম৩= ২১টি পাথর মারা। সর্বমোট তিন দিনে ৭+২১+২১=৪৯টি কঙ্কর মারা।\n" +
                "(১০) ‘বিদায়ী তাওয়াফে’ (মক্কার বাইরের লোকদের জন্য) বিদায়ের পূর্বে। এটি ওয়াজিব।\n" +
                "(১১) তাওয়াফে কুদুম করা। (মক্কায় গিয়ে সর্বপ্রথম)", "1", "1"));


        duaItems.add(new DuaItems("২য় প্রকার হজ্জে কেরানের জরুরী কাজ", "1", "৩টি ফরজ\n" +
                "(১) ইহরাম (হজ্জ ও ওমরাহর জন্য)\n" +
                "(২) আরাফাতে অবস্থান।\n" +
                "(৩) তাওয়াফুয যিয়ারাত।১০টি ওয়াজিব\n" +
                "(৪) ওমরাহর তাওয়াফ\n" +
                "(৫) ওমরাহর সায়ী\n" +
                "(৬) হজ্জের সায়ী\n" +
                "(৭) অকুফে মুযদালিফায়\n" +
                "(৮) ১০ই জিলহজ্ব তারিখে বড় শয়তানকে ৭টি পাথর মারা (দুপুর ১২টার পূর্বে) সুন্নত।\n" +
                "(৯) দম দিতে হবে।\n" +
                "(১০) মাথা মুন্ডানো।\n" +
                "(১১) ১১ই জিলহজ্ব তারিখে তিন শয়তানকে পাথর মারা\n" +
                "(১২) ১২ তারিখে তিন শয়তানকে পূর্বের ছকের নিয়মে পৃথক পৃথক ভাবে সূর্য হেলার পরে নিয়ম অনুযায়ী পাথর মারা।\n" +
                "(১৩) বিদায়ী তাওয়াফ।", "1", "1"));


        duaItems.add(new DuaItems("৩য় প্রকার হজ্জে তামাত্তুর ১৫টি জরুরী কাজ ফরজ", "1", "৪টি ফরজ\n" +
                "(১) ওমরাহর ইহরাম (বাংলাদেশ)।\n" +
                "(২) হজ্জের ইহরাম (৮ তারিখ মক্কায়)\n" +
                "(৩) উ,কুফে আরাফা (৯ই জিলহজ্জ সূর্য হেলার পর থেকে সুর্যস্তের পূর্ব মুহুর্ত পর্যন্ত)।\n" +
                "(৪) তাওয়াফে জিয়ারত (১০ তারিখ অথবা ১১, ১২ তারিখ)১১টি ওয়াজিব\n" +
                "(৫) তাওয়াফে ওমরাহ (মক্কায় গিয়েই)\n" +
                "(৬) ওমরাহর সায়ী (ওমরাহ তাওয়াফের পরই)\n" +
                "(৭) মাথা মুন্ডানো (ওমরাহর পর)।\n" +
                "(৮) হজ্জের সায়ী\n" +
                "(৯) বড় শয়তানকে ৭টি পাথর মারা ( ১০ই জিলহজ্ব তারিখ সুর্য হেলার বা ১২টা পূর্বে) সুন্নত।\n" +
                "(১০) কুরবানী করা (পাথর মেরে ১০ তারিখ)।\n" +
                "(১১) মাথা মুন্ডানো দম দিতে হবে।\n" +
                "(১২) ১১ তারিখ তিন শয়তানকে ৭+৭+৭=২১টি পাথর মারা।\n" +
                "(১৩) ১২ তারিখে তিন শয়তানকে ৭+৭+৭=২১টি পাথর মারা (সর্বমোট তিন দিনে ৭+২১+২১=৪৯টি পাথর মারতে হবে)।\n" +
                "(১৪) বিদায়ী তাওয়াফ।", "1", "1"));


        duaItems.add(new DuaItems("১ম দিন ৮ই জিলহজ্জ", "1", "ইহরাম অবস্থায় (ফরয) মক্কা থেকে হজ্জের নিয়্যাতে মিনায় রওয়ানা হোন।\n" +
                "\n" +
                "এ দিনের কাজ দু’টি\n" +
                "(১) ইহরাম (ফরজ) (২) ৫ ওয়াক্ত নামাজ মিনায় আদায় করা (সুন্নাত)।\n" +
                "যোহর, আছর, মাগরিব, এশা ও ৯ তারিখ ফজর সর্বমোট ৫ ওয়াক্ত", "1", "1"));


        duaItems.add(new DuaItems("২য় দিন ৯ই জিলহজ্জ", "1", "১। আরাফাতে অবস্থান (ফরজ)। ২। অকুফে মুযদালিফায় (ওয়াজিব)", "1", "1"));


        duaItems.add(new DuaItems("আরাফাতে অবস্থান", "1", "–  ফজরের নামাজ মিনায় পড়ে আরাফাতের ময়দানের দিকে রওয়ানা হোন।\n" +
                "–  আরাফাতে সূর্য হেলার পর অর্থাৎ ১২টার পর থেকে সূর্যাস্ত পর্যন্ত অবস্থান করা হজ্জের গুরুত্বপূর্ণ ফরজ।\n" +
                "–  ওয়াক্ত মত তাবুতে (মসজিদে নামেরায় না গেলে) বা আরাফার ময়দানে যে কোন স্থানে জোহরের সময় জোহর নামাজ আদায় করুন।\n" +
                "–  আসরের নামাজ আসরের সময় আদায় করুন, নির্দিষ্ট সময় বা আগে পরে, পৃথক পৃথক ভাবে।\n" +
                "–  উল্লেখ্য: ‘মসজিদে নামেরায়’ জোহর ও আসরের জামাত এক আযান দুই ইকামাতে একত্রে আদায় করলে একত্রে দুই ওয়াক্ত আদায় করতে হয়, ওটার নাম ‘জমে তাক্বদীম’। কিন্তু তাবুতে বা অন্য কোন স্থানে একত্রে নয়। ভিন্ন সময় ভিন্ন ভাবে ওয়াক্ত মত আদায় করতে হবে।)", "1", "1"));


        duaItems.add(new DuaItems("অকুফে মুযদালিফায় (ওয়াজিব)", "1", "–  সূর্যাস্তের পর সাথে সাথে মাগরিব না পড়ে মুযদালিফায় রওয়ানা হোন।\n" +
                "\n" +
                "–  মুযদালিফায় মাগরিব ও এশার নামাজ এক আযান দুই এক্বামাতে একত্রে আদায় করুন। এটা ওয়াজিব এটার নাম ‘জামে তাখীর জামাতে পড়া উত্তম। মুযদালিফায় অবস্থান (ওয়াজিব) মুযদালিফায় থাকাকালীন পাহাড়ে অথবা তার পাদদেশে যে কোন ঘাস দুবলা থেকে খুঁজে খুঁজে পাথর মারার জন্য ৭২টি (চানাবুটের ন্যায় কঙ্কর) ছোট ছোট পাথর সংগ্রহ করে ইহরামের কাপড়ে বেঁধে নিন।\n" +
                "\n" +
                "১০/১১/১২ তিন দিনে (৪৯টি পাথর) তিন শয়তানকে মারতে হবে।\n" +
                "–  ১ম দিন ৭টি\n" +
                "–  ২য় দিন ২১টি\n" +
                "–  ৩য় দিন ২১টি\n" +
                "(সর্বমোট তিন দিনে ৭+২১+২১=৪৯টি )। তবে মিসিং হতে পারে বলে বেশী (৭২) নেওয়া সুন্নাত।", "1", "1"));


        duaItems.add(new DuaItems("৩য় দিন ১০ই জিলহজ্জ", "1", "এ দিনের মোট কাজ ৪টি (১) বড় শয়তানকে পাথর মারা (২) কুরবানী (৩) মাথা মুন্ডানো (৪) তাওয়াফে যিয়ারাত করা\n" +
                "–  মুযদালিফায় ফজরের নামাজ পড়ে সূর্য উদয়ের আগ পর্যন্ত অবস্থান করুন (ওয়াজিব)।\n" +
                "–  মিনায় পৌছে বড় শয়তানকে ৭টি পাথর সূর্য হেলার আগে (১২টার পূর্বেই) মারুন। (সুন্নাত)।\n" +
                "–  তারপর তামাত্তু ও কি্বরান হজ্জকারীগণ কুরবানী করুন (ওয়াজিব)।\n" +
                "–  এরপর ইহরাম খুলে হালাল হয়ে স্বাভাবিক পোষাক পরিধান করুন। কিন্তু কোরবানী পূর্বে নয়। (তবে ইফরাদ হজ্জকারী কুরবানী না করলেও চলবে)।\n" +
                "–  চুল ছাড়া বা মুন্ডানোর পর মক্কায় গিয়ে (সম্ভব হলে উত্তম) আজই তাওয়াফে যিয়ারত করুন। আজ করা সর্বোত্তম। (এটা ফরজ)।\n" +
                "–  তাওয়াফ শেষে মিনায় এসে রাত্রি যাপন করুন সুন্নাত।", "1", "1"));


        duaItems.add(new DuaItems("৪র্থ দিন ১১ই জিলহজ্জ", "1", "–  ১০ তারিখে কুরবানী, চুল ছাটা ও তাওয়াফে যিয়ারত না করে থাকলে আজ করুন।\n" +
                "–  সূর্য হেলার পর থেকে (১২টার পর) মিনায় তিন শয়তানকে সূর্যাস্তের পূর্বে (প্রথম ছোট, তারপর মেজ অতঃপর বড়) ৭+৭+৭=২১টি পাথর মারুন (ওয়াজিব)। মিনায় রাত্রি যাপন করুন (সুন্নাত)।", "1", "1"));


        duaItems.add(new DuaItems("৫ম দিন ১২ই জিলহজ্জ", "1", "–  তাওয়াফে যিয়ারত ১০/১১ তারিখে না করে থাকলে আজ সূর্যাস্তের পূর্বে অবশ্যই করুন।\n" +
                "–  মিনায় সূর্য হেলার পর থেকে (সুন্নাত সময় হল) সূর্যাস্তের পূর্বে ৭+৭+৭=২১টি পাথর (ছোট, মেজ ও বড় ) শয়তানকে মেরে সূর্যাস্তের পূর্বে) মক্কায় রওয়ানার চেষ্টা করুন।", "1", "1"));


        duaItems.add(new DuaItems("জরুরী কথা", "1", "(১) তবে ১১/১২ তারিখ সূর্য হেলার পূর্বে পাথর মারলে আদায় হবে না। পূণরায় মারতে হবে। নতুবা  দম দিতে হবে।\n" +
                "(২) যদি ১২ তারিখ সূর্যাস্তের পূর্বে মীনা ত্যাগ করে মক্কায় রওয়ানা না হন তবে ১৩ তারিখ পূনরায় তিন  শয়তানকে ৭+৭+৭=২১টি\n" +
                "পাথর (ছোট, মেজ ও বড় ) মেরে (পূর্বের নিয়মে) তারপর মক্কায় আসতে হবে।\n" +
                "(৩) তাওয়াফে যিয়ারতের উত্তম সময় ১০ই জিলহজ্জ (তবে ৩ দিন, এর সব মোট সময়) শেষ সময়  ১২ই জিলহজ্জ সূর্যাস্ত পর্যন্ত।\n" +
                "(৪) মক্কা থেকে মিনায় রওয়ানার পূর্বে যদি নফল তাওয়াফ করে হজ্জের নিয়্যাত সায়ী না করে থাকেন  (বা মিনায় আসেন) তাহলে হজ্জের পরে তাওয়াফে যিয়ারতের পর অবশ্যই হজ্জের সায়ী করুন।\n" +
                "(ওয়াজিব)।", "1", "1"));
        duaItems.add(new DuaItems("যিয়ারাতে মদীনাহ", "1", "হজ্জের পূর্বে অথবা পরে (সুবিধামত) সময়ে হাজীদল তথা প্রিয় নবী হযরত মুহাম্মদ মুস্তাফা (দঃ) এর পাগলপাড়া উম্মতগণ এক মূহুর্তে একদিন/তথা ৮ দিনের জন্য (সম্ভব হলে) নতুবা এক রাত হলেও মদীনা শরীফে যান এবং রাসূলে পাক (দঃ) এর রওজা মোবারক যিয়ারত, রিয়াদুল জান্নাতে বসা (নামাজ আদায় করা) জান্নাতুল বাকী যিয়ারত করা এবং বিশেষতঃ ৮ দিনে ৪০ ওয়াক্ত নামাজ জামাতে আদায় করাসহ বহু ঐতিহাসিক স্থান তথা উহুদ পাহাড় ও বদর প্রান্তর দেখার সৌভাগ্য অর্জন করে থাকেন। এছাড়া মদীনা শরীফে আর কোন কাজ নেই। মূলতঃ মদীনা শরীফে মাসজি দে নববীতে নামাজ ও রাসূলের পাক (দঃ) এর রওজা শরীফ যিয়ারতই হল প্রধান কাজ। যদি সম্ভব হয় বা সময় সূযোগ থাকে তাহলে ৪০ ওয়াক্ত নামাজ (সুন্নাত) রয়েছে। কিন্তু তার অর্থ এই নয় যে, ৮দিন=৪০ ওয়াক্ত থাকতেই হবে। এটা ফরজ বা ওয়াজিব নয়। আসলে এটা সুন্নাত এবং হজ্জের অংশ নয়। মূলতঃ আশেকে রাসূল (দঃ) দের জন্য রাসূলে পাক (দঃ) এর রওজা মোবারক যিয়ারতের নিয়্যাতে যাওয়াই হল মূল।", "1", "1"));
        duaItems.add(new DuaItems("বদলী হজ্জ", "1", "যে সকল মুসলিম নর-নারীর উপর হজ্জ ফরজ ছিল, তাঁদের মধ্যে যদি কেউ মৃতু্যবরণ করে অথবা জীবিত কিন্তু শারিরীক দুর্বলতা ও অসুস্থতা ও অমতার কারণে হজ্জ করতে অপারগ হয়, তাহলে অন্য কাউকে দিয়ে বিশেষ করে বিজ্ঞ আলেম বা হজ্জে পারদশর্ী ব্যক্তি দ্বারা তাঁর বদলী হজ্জ করাতে পারবে। অথর্াৎ যাঁর জন্য বদলী হজ্জ করা হবে তাঁরই নামে ইহরাম পরিধান ও নিয়্যাত করে অন্য একজন হজ্জ আদায়\n" +
                "করতে পারবে।\n" +
                "\n" +
                "সংকলনে: মাওলানা মুহাম্মদ আমিনুল হক", "1", "1"));




    }
}